       FD ALUMNOS LABEL RECORD IS STANDARD.
       01 REG-ALUMNO.
          03 ALU-CODIGO           PIC 9(03).
          03 ALU-APELLIDO         PIC X(20).
          03 ALU-NOMBRE           PIC X(20).
          03 ALU-CODIGO-CURSO     PIC 9(02).
          03 ALU-CODIGO-PROVINCIA PIC 9(02).

