       FD ASCALU LABEL RECORD IS STANDARD.
       01 REG-ASCALU.
          03 R-CODIGO   PIC 9(03).
          03 R-APELLIDO PIC X(21).
          03 R-NOMBRE   PIC X(21).

