       FD PROVINCIAS LABEL RECORD IS STANDARD.
       01 REG-PROVINCIAS.
          03 PRO-CODIGO        PIC 9(02).
          03 PRO-DESCRIPCION   PIC X(30).
          03 PRO-ABREVIATURA   PIC X(04).
