           SELECT ALUMNOS ASSIGN RANDOM "ALUMNOS.IDX"
                      ORGANIZATION INDEXED
                      ACCESS DYNAMIC
                      RECORD KEY ALU-CODIGO
					  ALTERNATE RECORD KEY ALU-CODIGO-CURSO 
					     WITH DUPLICATES
					  ALTERNATE RECORD KEY ALU-CODIGO-PROVINCIA 
					     WITH DUPLICATES
                      FILE STATUS ST-ALUMNOS.
