           SELECT CURSOS ASSIGN RANDOM "CURSOS.IDX"
                      ORGANIZATION INDEXED
                      ACCESS DYNAMIC
                      RECORD KEY CUR-CODIGO
                      FILE STATUS ST-CURSOS.
