           SELECT PROVINCIAS ASSIGN RANDOM "PROVIN.IDX"
                      ORGANIZATION INDEXED
                      ACCESS DYNAMIC
                      RECORD KEY PRO-CODIGO
                      FILE STATUS ST-PROVINCIAS.
